app/controllers/queue_images_controller.rb

  def index
    #@items= current_client.queue_images.all.order('created_at DESC')
    #@items= policy_scope(current_client.queue_images).order('created_at DESC').paginate(:page => params[:page], :per_page => 6)
    authorize QueueImage
    @items = policy_scope(current_client.queue_images).order('created_at DESC').paginate(:page => params[:page], :per_page => 6)
---
SELECT COUNT(*) FROM `queue_images` WHERE `queue_images`.`client_id` = 1 AND (status > -10 and status < 20)

  def new
    @queue_image = QueueImage.new
    @styles = Style.where(status: ConstHelper::GALLERY_STYLE_IMAGE).order('use_counter desc')
---
SELECT `styles`.* FROM `styles` WHERE `styles`.`status` = 201  ORDER BY use_counter desc

  def tag
    tags = params.map{ |key,value| value == '1' ? key : nil }.compact
    @styles = Style.where(status: ConstHelper::GALLERY_STYLE_IMAGE).order('use_counter desc')
---
SELECT  styles.* FROM `styles` WHERE `styles`.`status` = 201 AND (EXISTS (SELECT 1 FROM taggings style_taggings_c0f6d6a WHERE style_taggings_c0f6d6a.taggable_id = styles.id AND style_taggings_c0f6d6a.taggable_type = 'Style' AND style_taggings_c0f6d6a.tag_id in (1, 2)))  ORDER BY use_counter desc

    def set_queue_image
      @queue_image = QueueImage.find(params[:id])
---
SELECT  `queue_images`.* FROM `queue_images` WHERE `queue_images`.`id` = 0 LIMIT 1