app/controllers/queue_images_controller.rb

  def create
    authorize QueueImage
    unless valid_queue_image_params
      redirect_to new_queue_image_path
      return
    end

    max_reached = current_client.reached_maximum?
    qi_service = QueueImageService.new queue_image_params, current_client
    save_status = qi_service.create_queue
---
INSERT INTO `queue_images` (`client_id`, `content_id`, `style_id`, `status`, `end_status`, `created_at`, `updated_at`) VALUES (28, NULL, NULL, 1, 101, '2017-01-24 19:20:53', '2017-01-24 19:20:53')