app/controllers/static_pages_controller.rb

SELECT  `queue_images`.* FROM `queue_images` WHERE (status = 11)  ORDER BY ftime DESC LIMIT 6 OFFSET 0
---
  def lenta
    par = params[:last_days]
    if par.present? && par.to_i
      if par.to_i > 0
        @items= QueueImage.where("status = 11").last_n_days(par.to_i).order('likes_count DESC, ftime DESC').paginate(:page => params[:page], :per_page => 6)
      else
        @items= QueueImage.where("status = 11 && is_premium = true").order('likes_count DESC, ftime DESC').paginate(:page => params[:page], :per_page => 6)
      end
    else
      @items= QueueImage.where("status = 11").order('ftime DESC').paginate(:page => params[:page], :per_page => 12)