app/views/queue_images/_show_styles.html.erb

SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN styles ON styles.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Style' AND taggings.context = 'tags') AND (taggings.taggable_id IN (1,2)) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
    <% styles.each do |si| %>
      <% tags = si.tag_list.map { |item| item.parameterize('-') } %>